const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', () => {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', () => {
  expect(sum(20,1)).toBe(21);
});


// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', () => {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
test('39 + 6 เท่ากับ 45', () => {
  expect(sum(39,6)).toBe(45);
});

test('12 + 8 เท่ากับ 20', () => {
  expect(sum(12,8)).toBe(20);
});

test('9 + 9 เท่ากับ 18', () => {
  expect(sum(9,9)).toBe(18);
});